#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
aws_security_group.ecs_sg: Refreshing state... [id=sg-096b0d70279da4976]
aws_vpc.ecs_vpc: Refreshing state... [id=vpc-0406e7d27a7026b6f]
aws_ecr_repository.main: Refreshing state... [id=javaapp-test-ecs]
aws_internet_gateway.gw: Refreshing state... [id=igw-0a3bfc8db881d560f]
aws_subnet.public_subnet_b: Refreshing state... [id=subnet-01a61d1e52880b5ec]
aws_subnet.private_subnet_a: Refreshing state... [id=subnet-0ad7e5b5938313d90]
aws_subnet.public_subnet_a: Refreshing state... [id=subnet-073ca49ae6a73ec51]
aws_subnet.private_subnet_b: Refreshing state... [id=subnet-012e875080b74928f]
aws_route_table.route_table_private: Refreshing state... [id=rtb-0d91e2ee8796d96d7]
aws_route_table_association.rt_associate_private_b: Refreshing state... [id=rtbassoc-018dc83856e963de1]
aws_route_table.route_table_public: Refreshing state... [id=rtb-08e59df5ebc5d493f]
aws_route_table_association.rt_associate_private_a: Refreshing state... [id=rtbassoc-0f35eea2959284fa3]
aws_route_table_association.rt_associate_public_a: Refreshing state... [id=rtbassoc-00ce7be09cf46fd13]
aws_route_table_association.rt_associate_public_b: Refreshing state... [id=rtbassoc-0b33b7a99c4841e73]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_alb.this will be created
  + resource "aws_alb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "ECS-ALB"
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-01a61d1e52880b5ec",
          + "subnet-073ca49ae6a73ec51",
        ]
      + tags                       = {
          + "Name" = "ECS ALB"
        }
      + tags_all                   = {
          + "Name" = "ECS ALB"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # aws_lb_listener.this will be created
  + resource "aws_lb_listener" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.this will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "ALB-TG"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0406e7d27a7026b6f"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # aws_security_group.ecs_private will be created
  + resource "aws_security_group" "ecs_private" {
      + arn                    = (known after apply)
      + description            = "Allow access from internet"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow ingress from internet"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow ingress from internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "allow ingress from internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "ecs_sg_private"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "allow_internet"
        }
      + tags_all               = {
          + "Name" = "allow_internet"
        }
      + vpc_id                 = "vpc-0406e7d27a7026b6f"
    }

  # aws_security_group.ecs_sg will be destroyed
  # (because aws_security_group.ecs_sg is not in configuration)
  - resource "aws_security_group" "ecs_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:947810884862:security-group/sg-096b0d70279da4976" -> null
      - description            = "Allow access from internet" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-096b0d70279da4976" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "allow ingress from internet"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "ecs_alb_sg" -> null
      - owner_id               = "947810884862" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "allow_internet"
        } -> null
      - tags_all               = {
          - "Name" = "allow_internet"
        } -> null
      - vpc_id                 = "vpc-0406e7d27a7026b6f" -> null
    }

  # aws_security_group.ecs_sg_public will be created
  + resource "aws_security_group" "ecs_sg_public" {
      + arn                    = (known after apply)
      + description            = "Allow access from internet"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow ingress from internet"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow ingress from internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow ingress from internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "ecs_alb_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "allow_internet"
        }
      + tags_all               = {
          + "Name" = "allow_internet"
        }
      + vpc_id                 = "vpc-0406e7d27a7026b6f"
    }

  # aws_security_group.sg_alb will be created
  + resource "aws_security_group" "sg_alb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SG for ALB"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Load Balancer"
        }
      + tags_all               = {
          + "Name" = "Load Balancer"
        }
      + vpc_id                 = "vpc-0406e7d27a7026b6f"
    }

Plan: 6 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + igw_id                 = "igw-0a3bfc8db881d560f"
  + route_table_id_private = "rtb-0d91e2ee8796d96d7"
  + route_table_id_public  = "rtb-08e59df5ebc5d493f"
  + vpc_id                 = "vpc-0406e7d27a7026b6f"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @EvandroCarvalho, Action: `pull_request`*